```terraform
[command]/home/runner/work/_temp/ceb511dc-1879-4b46-815d-953cf668c94b/terraform-bin plan -out=environment.tfplan -no-color
module.rds.aws_ssm_parameter.db_instance_password: Refreshing state... [id=/terraform/staging/rds/db_password]
module.apigateway.aws_api_gateway_rest_api.default: Refreshing state... [id=l6xivppfkg]
module.ec2.aws_key_pair.bastion[0]: Refreshing state... [id=staging-bastion_key_pair]
data.aws_caller_identity.current: Reading...
module.sqs.aws_sqs_queue.checklist_generation_processor_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/791901361445/staging-checklist-generation-processor-queue]
module.iam.data.aws_iam_role.lambda_role[0]: Reading...
module.dynamodb.aws_dynamodb_table.access_token: Refreshing state... [id=staging-AccessToken]
module.s3.aws_s3_bucket.data_question_response_video: Refreshing state... [id=staging-data-question-response-video]
module.sqs.aws_sqs_queue.checklist_evaluation_processor_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/791901361445/staging-checklist-evaluation-processor-queue]
data.aws_ssm_parameter.route53_hosted_zone: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=791901361445]
module.vpc.aws_vpc.main[0]: Refreshing state... [id=vpc-0a2c6ea576ea1c2a5]
data.aws_ssm_parameter.route53_hosted_zone: Read complete after 0s [id=/terraform/shared/route53/hosted_zone]
module.dynamodb.aws_dynamodb_table.interview_access_token: Refreshing state... [id=staging-InterviewAccessToken]
module.iam.data.aws_iam_role.lambda_role[0]: Read complete after 0s [id=lambda_role]
module.app[0].aws_cloudfront_origin_access_identity.origin_access_identity: Refreshing state... [id=E1ENRFIZYLVUVH]
module.sqs.aws_sqs_queue.question_generation_processor_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/791901361445/staging-question-generation-processor-queue]
module.route53[0].data.aws_route53_zone.main: Reading...
module.ec2.aws_eip.nat[0]: Refreshing state... [id=eipalloc-00a8a7c27741f73bd]
data.aws_ssm_parameter.route53_zone_id: Reading...
data.aws_region.current: Reading...
data.aws_region.current: Read complete after 0s [id=us-east-1]
module.rds.aws_ssm_parameter.db_instance_username: Refreshing state... [id=/terraform/staging/rds/db_username]
module.vpc.data.aws_vpc.default: Reading...
data.aws_ssm_parameter.route53_zone_id: Read complete after 0s [id=/terraform/shared/route53/zone_id]
module.sqs.aws_ssm_parameter.checklist_generation_processor_queue_arn: Refreshing state... [id=/terraform/staging/sqs/checklist_generation_processor_queue_arn]
module.sqs.aws_ssm_parameter.checklist_generation_processor_queue_url: Refreshing state... [id=/terraform/staging/sqs/checklist_generation_processor_queue_url]
module.apigateway.aws_ssm_parameter.api_gateway_id: Refreshing state... [id=/terraform/staging/api_gateway/id]
module.apigateway.aws_ssm_parameter.api_gateway_root_resource_id: Refreshing state... [id=/terraform/staging/api_gateway/root_resource_id]
module.sqs.aws_ssm_parameter.checklist_evaluation_processor_queue_url: Refreshing state... [id=/terraform/staging/sqs/checklist_evaluation_processor_queue_url]
module.sqs.aws_ssm_parameter.checklist_evaluation_processor_queue_arn: Refreshing state... [id=/terraform/staging/sqs/checklist_evaluation_processor_queue_arn]
module.sqs.aws_ssm_parameter.question_generation_processor_queue_url: Refreshing state... [id=/terraform/staging/sqs/question_generation_processor_queue_url]
module.sqs.aws_ssm_parameter.question_generation_processor_queue_arn: Refreshing state... [id=/terraform/staging/sqs/question_generation_processor_queue_arn]
module.route53[0].data.aws_route53_zone.main: Read complete after 0s [id=Z0419438LZ88EPNOCFMA]
aws_ssm_parameter.domain_name: Refreshing state... [id=/terraform/staging/domain_name]
module.app[0].aws_s3_bucket.main: Refreshing state... [id=app.staging.matchya.ai]
module.apigateway.aws_api_gateway_gateway_response.unauthorized_response: Refreshing state... [id=aggr-l6xivppfkg-UNAUTHORIZED]
module.app[0].aws_s3_bucket.www: Refreshing state... [id=www.app.staging.matchya.ai]
module.apigateway.aws_api_gateway_gateway_response.default_4xx: Refreshing state... [id=aggr-l6xivppfkg-DEFAULT_4XX]
module.apigateway.aws_api_gateway_gateway_response.default_5xx: Refreshing state... [id=aggr-l6xivppfkg-DEFAULT_5XX]
module.s3.aws_s3_bucket_public_access_block.data_question_response_video: Refreshing state... [id=staging-data-question-response-video]
module.s3.aws_s3_bucket_cors_configuration.data_question_response_video: Refreshing state... [id=staging-data-question-response-video]
module.s3.aws_s3_bucket_policy.data_question_response_video: Refreshing state... [id=staging-data-question-response-video]
module.vpc.data.aws_vpc.default: Read complete after 0s [id=vpc-02b04f5cc72d62471]
module.vpc.aws_subnet.private_1[0]: Refreshing state... [id=subnet-0c0048599d2031070]
module.vpc.aws_ssm_parameter.vpc_id: Refreshing state... [id=/terraform/staging/vpc/id]
module.vpc.aws_vpc_endpoint.dynamodb: Refreshing state... [id=vpce-0fa7cfaddc1224493]
module.vpc.aws_subnet.public_2[0]: Refreshing state... [id=subnet-0ecb9c72602fa0542]
module.vpc.aws_internet_gateway.main[0]: Refreshing state... [id=igw-0ff1464a92bb07eb2]
module.vpc.aws_subnet.private_2[0]: Refreshing state... [id=subnet-0726a597984ed238a]
module.vpc.aws_security_group.lambda: Refreshing state... [id=sg-0b03235b8bdedcfda]
module.vpc.aws_vpc_endpoint.s3: Refreshing state... [id=vpce-0b17f8e4d9515df62]
module.vpc.aws_security_group.ec2_public: Refreshing state... [id=sg-04e85193e7fb092b2]
module.vpc.aws_security_group.rds_postgres_secure[0]: Refreshing state... [id=sg-0a4c483087f4e3b71]
module.vpc.aws_subnet.public_1[0]: Refreshing state... [id=subnet-06cf952d5845d1e74]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0a24b88055982d8e7]
module.vpc.aws_ssm_parameter.subnet_public_2: Refreshing state... [id=/terraform/staging/vpc/subnet_id/public_2]
module.vpc.aws_ssm_parameter.subnet_private_2[0]: Refreshing state... [id=/terraform/staging/vpc/subnet_id/private_2]
module.vpc.aws_ssm_parameter.security_group_lambda: Refreshing state... [id=/terraform/staging/vpc/security_group_id/lambda]
module.vpc.aws_security_group.vpc_endpoint[0]: Refreshing state... [id=sg-07381fe46aca5ce9d]
module.vpc.aws_ssm_parameter.subnet_private_1[0]: Refreshing state... [id=/terraform/staging/vpc/subnet_id/private_1]
module.vpc.aws_ssm_parameter.subnet_public_1: Refreshing state... [id=/terraform/staging/vpc/subnet_id/public_1]
module.vpc.aws_nat_gateway.nat[0]: Refreshing state... [id=nat-069a793c2ae6d655f]
module.vpc.aws_route_table_association.public_2[0]: Refreshing state... [id=rtbassoc-0111cab42a3b8778b]
module.vpc.aws_route_table_association.public_1[0]: Refreshing state... [id=rtbassoc-0521ff9d78e1b21e2]
module.rds.aws_db_subnet_group.secure[0]: Refreshing state... [id=staging]
module.app[0].aws_s3_bucket_public_access_block.www: Refreshing state... [id=www.app.staging.matchya.ai]
module.app[0].aws_s3_bucket_website_configuration.www: Refreshing state... [id=www.app.staging.matchya.ai]
module.ec2.aws_instance.bastion[0]: Refreshing state... [id=i-00512efc39438faca]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-005bc3692e4a595fa]
module.app[0].aws_acm_certificate.cert: Refreshing state... [id=arn:aws:acm:us-east-1:791901361445:certificate/e667d549-0230-491a-9fb3-ff620beb6361]
module.app[0].aws_s3_bucket_public_access_block.main: Refreshing state... [id=app.staging.matchya.ai]
module.app[0].aws_s3_bucket_website_configuration.main: Refreshing state... [id=app.staging.matchya.ai]
module.app[0].aws_s3_bucket_policy.www: Refreshing state... [id=www.app.staging.matchya.ai]
module.vpc.aws_route_table_association.private_2[0]: Refreshing state... [id=rtbassoc-088f0be8b3eacb2ca]
module.vpc.aws_route_table_association.private_1[0]: Refreshing state... [id=rtbassoc-060c8560abd333606]
module.rds.aws_db_instance.secure[0]: Refreshing state... [id=db-KWJOE7ZAO5CCIOYKPIU72KYFF4]
module.app[0].aws_route53_record.cert_validation["www.app.staging.matchya.ai"]: Refreshing state... [id=Z0419438LZ88EPNOCFMA__d3f0f366e8ab12f2c28f8e19045dc232.www.app.staging.matchya.ai._CNAME]
module.app[0].aws_route53_record.cert_validation["app.staging.matchya.ai"]: Refreshing state... [id=Z0419438LZ88EPNOCFMA__6540cac5e101cd74dc59720437629215.app.staging.matchya.ai._CNAME]
module.rds.aws_ssm_parameter.db_instance_name: Refreshing state... [id=/terraform/staging/rds/db_name]
module.rds.aws_ssm_parameter.db_instance_endpoint: Refreshing state... [id=/terraform/staging/rds/endpoint]
module.rds.aws_ssm_parameter.db_instance_port: Refreshing state... [id=/terraform/staging/rds/port]
module.app[0].aws_acm_certificate_validation.cert: Refreshing state... [id=2024-01-16 05:21:14.339 +0000 UTC]
module.app[0].aws_cloudfront_distribution.main: Refreshing state... [id=EUYAGYQTRL1WL]
module.app[0].aws_cloudfront_distribution.www: Refreshing state... [id=E2GZMTIUVXE6U8]
module.app[0].aws_ssm_parameter.cloud_distribution_url: Refreshing state... [id=/terraform/staging/cloudfront/url/app.staging.matchya.ai]
module.route53[0].aws_route53_record.app: Refreshing state... [id=Z0419438LZ88EPNOCFMA_app.staging.matchya.ai_A]
module.app[0].aws_ssm_parameter.cloudfront_distribution_id: Refreshing state... [id=/terraform/staging/www.app.staging.matchya.ai/cloudfront_distribution_id]
module.app[0].aws_ssm_parameter.www_cloud_distribution_url: Refreshing state... [id=/terraform/staging/cloudfront/url/www.app.staging.matchya.ai]
module.route53[0].aws_route53_record.www_app: Refreshing state... [id=Z0419438LZ88EPNOCFMA_www.app.staging.matchya.ai_A]
module.ec2.aws_eip.bastion[0]: Refreshing state... [id=eipalloc-0adce4ee56c7a5b5c]
module.ec2.aws_ssm_parameter.bastion_ip[0]: Refreshing state... [id=/terraform/staging/ec2/elastic_ip/bastion_host]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.rds.aws_db_instance.secure[0] will be updated in-place
  ~ resource "aws_db_instance" "secure" {
      ~ final_snapshot_identifier             = "staging-final-snapshot-2024-01-27-17-58-16" -> (known after apply)
        id                                    = "db-KWJOE7ZAO5CCIOYKPIU72KYFF4"
        tags                                  = {}
        # (52 unchanged attributes hidden)
    }

  # module.s3.aws_s3_bucket.company_assets will be created
  + resource "aws_s3_bucket" "company_assets" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "matchya-staging-company-assets"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.s3.aws_s3_bucket_policy.bucket_policy will be created
  + resource "aws_s3_bucket_policy" "bucket_policy" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.s3.aws_s3_bucket_public_access_block.company_assets will be created
  + resource "aws_s3_bucket_public_access_block" "company_assets" {
      + block_public_acls       = false
      + block_public_policy     = false
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = false
      + restrict_public_buckets = false
    }

Plan: 3 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: environment.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "environment.tfplan"
::debug::Terraform exited with code 0.
::debug::stdout: module.rds.aws_ssm_parameter.db_instance_password: Refreshing state... [id=/terraform/staging/rds/db_password]%0Amodule.apigateway.aws_api_gateway_rest_api.default: Refreshing state... [id=l6xivppfkg]%0Amodule.ec2.aws_key_pair.bastion[0]: Refreshing state... [id=staging-bastion_key_pair]%0Adata.aws_caller_identity.current: Reading...%0Amodule.sqs.aws_sqs_queue.checklist_generation_processor_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/791901361445/staging-checklist-generation-processor-queue]%0Amodule.iam.data.aws_iam_role.lambda_role[0]: Reading...%0Amodule.dynamodb.aws_dynamodb_table.access_token: Refreshing state... [id=staging-AccessToken]%0Amodule.s3.aws_s3_bucket.data_question_response_video: Refreshing state... [id=staging-data-question-response-video]%0Amodule.sqs.aws_sqs_queue.checklist_evaluation_processor_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/791901361445/staging-checklist-evaluation-processor-queue]%0Adata.aws_ssm_parameter.route53_hosted_zone: Reading...%0Adata.aws_caller_identity.current: Read complete after 0s [id=791901361445]%0Amodule.vpc.aws_vpc.main[0]: Refreshing state... [id=vpc-0a2c6ea576ea1c2a5]%0Adata.aws_ssm_parameter.route53_hosted_zone: Read complete after 0s [id=/terraform/shared/route53/hosted_zone]%0Amodule.dynamodb.aws_dynamodb_table.interview_access_token: Refreshing state... [id=staging-InterviewAccessToken]%0Amodule.iam.data.aws_iam_role.lambda_role[0]: Read complete after 0s [id=lambda_role]%0Amodule.app[0].aws_cloudfront_origin_access_identity.origin_access_identity: Refreshing state... [id=E1ENRFIZYLVUVH]%0Amodule.sqs.aws_sqs_queue.question_generation_processor_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/791901361445/staging-question-generation-processor-queue]%0Amodule.route53[0].data.aws_route53_zone.main: Reading...%0Amodule.ec2.aws_eip.nat[0]: Refreshing state... [id=eipalloc-00a8a7c27741f73bd]%0Adata.aws_ssm_parameter.route53_zone_id: Reading...%0Adata.aws_region.current: Reading...%0Adata.aws_region.current: Read complete after 0s [id=us-east-1]%0Amodule.rds.aws_ssm_parameter.db_instance_username: Refreshing state... [id=/terraform/staging/rds/db_username]%0Amodule.vpc.data.aws_vpc.default: Reading...%0Adata.aws_ssm_parameter.route53_zone_id: Read complete after 0s [id=/terraform/shared/route53/zone_id]%0Amodule.sqs.aws_ssm_parameter.checklist_generation_processor_queue_arn: Refreshing state... [id=/terraform/staging/sqs/checklist_generation_processor_queue_arn]%0Amodule.sqs.aws_ssm_parameter.checklist_generation_processor_queue_url: Refreshing state... [id=/terraform/staging/sqs/checklist_generation_processor_queue_url]%0Amodule.apigateway.aws_ssm_parameter.api_gateway_id: Refreshing state... [id=/terraform/staging/api_gateway/id]%0Amodule.apigateway.aws_ssm_parameter.api_gateway_root_resource_id: Refreshing state... [id=/terraform/staging/api_gateway/root_resource_id]%0Amodule.sqs.aws_ssm_parameter.checklist_evaluation_processor_queue_url: Refreshing state... [id=/terraform/staging/sqs/checklist_evaluation_processor_queue_url]%0Amodule.sqs.aws_ssm_parameter.checklist_evaluation_processor_queue_arn: Refreshing state... [id=/terraform/staging/sqs/checklist_evaluation_processor_queue_arn]%0Amodule.sqs.aws_ssm_parameter.question_generation_processor_queue_url: Refreshing state... [id=/terraform/staging/sqs/question_generation_processor_queue_url]%0Amodule.sqs.aws_ssm_parameter.question_generation_processor_queue_arn: Refreshing state... [id=/terraform/staging/sqs/question_generation_processor_queue_arn]%0Amodule.route53[0].data.aws_route53_zone.main: Read complete after 0s [id=Z0419438LZ88EPNOCFMA]%0Aaws_ssm_parameter.domain_name: Refreshing state... [id=/terraform/staging/domain_name]%0Amodule.app[0].aws_s3_bucket.main: Refreshing state... [id=app.staging.matchya.ai]%0Amodule.apigateway.aws_api_gateway_gateway_response.unauthorized_response: Refreshing state... [id=aggr-l6xivppfkg-UNAUTHORIZED]%0Amodule.app[0].aws_s3_bucket.www: Refreshing state... [id=www.app.staging.matchya.ai]%0Amodule.apigateway.aws_api_gateway_gateway_response.default_4xx: Refreshing state... [id=aggr-l6xivppfkg-DEFAULT_4XX]%0Amodule.apigateway.aws_api_gateway_gateway_response.default_5xx: Refreshing state... [id=aggr-l6xivppfkg-DEFAULT_5XX]%0Amodule.s3.aws_s3_bucket_public_access_block.data_question_response_video: Refreshing state... [id=staging-data-question-response-video]%0Amodule.s3.aws_s3_bucket_cors_configuration.data_question_response_video: Refreshing state... [id=staging-data-question-response-video]%0Amodule.s3.aws_s3_bucket_policy.data_question_response_video: Refreshing state... [id=staging-data-question-response-video]%0Amodule.vpc.data.aws_vpc.default: Read complete after 0s [id=vpc-02b04f5cc72d62471]%0Amodule.vpc.aws_subnet.private_1[0]: Refreshing state... [id=subnet-0c0048599d2031070]%0Amodule.vpc.aws_ssm_parameter.vpc_id: Refreshing state... [id=/terraform/staging/vpc/id]%0Amodule.vpc.aws_vpc_endpoint.dynamodb: Refreshing state... [id=vpce-0fa7cfaddc1224493]%0Amodule.vpc.aws_subnet.public_2[0]: Refreshing state... [id=subnet-0ecb9c72602fa0542]%0Amodule.vpc.aws_internet_gateway.main[0]: Refreshing state... [id=igw-0ff1464a92bb07eb2]%0Amodule.vpc.aws_subnet.private_2[0]: Refreshing state... [id=subnet-0726a597984ed238a]%0Amodule.vpc.aws_security_group.lambda: Refreshing state... [id=sg-0b03235b8bdedcfda]%0Amodule.vpc.aws_vpc_endpoint.s3: Refreshing state... [id=vpce-0b17f8e4d9515df62]%0Amodule.vpc.aws_security_group.ec2_public: Refreshing state... [id=sg-04e85193e7fb092b2]%0Amodule.vpc.aws_security_group.rds_postgres_secure[0]: Refreshing state... [id=sg-0a4c483087f4e3b71]%0Amodule.vpc.aws_subnet.public_1[0]: Refreshing state... [id=subnet-06cf952d5845d1e74]%0Amodule.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0a24b88055982d8e7]%0Amodule.vpc.aws_ssm_parameter.subnet_public_2: Refreshing state... [id=/terraform/staging/vpc/subnet_id/public_2]%0Amodule.vpc.aws_ssm_parameter.subnet_private_2[0]: Refreshing state... [id=/terraform/staging/vpc/subnet_id/private_2]%0Amodule.vpc.aws_ssm_parameter.security_group_lambda: Refreshing state... [id=/terraform/staging/vpc/security_group_id/lambda]%0Amodule.vpc.aws_security_group.vpc_endpoint[0]: Refreshing state... [id=sg-07381fe46aca5ce9d]%0Amodule.vpc.aws_ssm_parameter.subnet_private_1[0]: Refreshing state... [id=/terraform/staging/vpc/subnet_id/private_1]%0Amodule.vpc.aws_ssm_parameter.subnet_public_1: Refreshing state... [id=/terraform/staging/vpc/subnet_id/public_1]%0Amodule.vpc.aws_nat_gateway.nat[0]: Refreshing state... [id=nat-069a793c2ae6d655f]%0Amodule.vpc.aws_route_table_association.public_2[0]: Refreshing state... [id=rtbassoc-0111cab42a3b8778b]%0Amodule.vpc.aws_route_table_association.public_1[0]: Refreshing state... [id=rtbassoc-0521ff9d78e1b21e2]%0Amodule.rds.aws_db_subnet_group.secure[0]: Refreshing state... [id=staging]%0Amodule.app[0].aws_s3_bucket_public_access_block.www: Refreshing state... [id=www.app.staging.matchya.ai]%0Amodule.app[0].aws_s3_bucket_website_configuration.www: Refreshing state... [id=www.app.staging.matchya.ai]%0Amodule.ec2.aws_instance.bastion[0]: Refreshing state... [id=i-00512efc39438faca]%0Amodule.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-005bc3692e4a595fa]%0Amodule.app[0].aws_acm_certificate.cert: Refreshing state... [id=arn:aws:acm:us-east-1:791901361445:certificate/e667d549-0230-491a-9fb3-ff620beb6361]%0Amodule.app[0].aws_s3_bucket_public_access_block.main: Refreshing state... [id=app.staging.matchya.ai]%0Amodule.app[0].aws_s3_bucket_website_configuration.main: Refreshing state... [id=app.staging.matchya.ai]%0Amodule.app[0].aws_s3_bucket_policy.www: Refreshing state... [id=www.app.staging.matchya.ai]%0Amodule.vpc.aws_route_table_association.private_2[0]: Refreshing state... [id=rtbassoc-088f0be8b3eacb2ca]%0Amodule.vpc.aws_route_table_association.private_1[0]: Refreshing state... [id=rtbassoc-060c8560abd333606]%0Amodule.rds.aws_db_instance.secure[0]: Refreshing state... [id=db-KWJOE7ZAO5CCIOYKPIU72KYFF4]%0Amodule.app[0].aws_route53_record.cert_validation["www.app.staging.matchya.ai"]: Refreshing state... [id=Z0419438LZ88EPNOCFMA__d3f0f366e8ab12f2c28f8e19045dc232.www.app.staging.matchya.ai._CNAME]%0Amodule.app[0].aws_route53_record.cert_validation["app.staging.matchya.ai"]: Refreshing state... [id=Z0419438LZ88EPNOCFMA__6540cac5e101cd74dc59720437629215.app.staging.matchya.ai._CNAME]%0Amodule.rds.aws_ssm_parameter.db_instance_name: Refreshing state... [id=/terraform/staging/rds/db_name]%0Amodule.rds.aws_ssm_parameter.db_instance_endpoint: Refreshing state... [id=/terraform/staging/rds/endpoint]%0Amodule.rds.aws_ssm_parameter.db_instance_port: Refreshing state... [id=/terraform/staging/rds/port]%0Amodule.app[0].aws_acm_certificate_validation.cert: Refreshing state... [id=2024-01-16 05:21:14.339 +0000 UTC]%0Amodule.app[0].aws_cloudfront_distribution.main: Refreshing state... [id=EUYAGYQTRL1WL]%0Amodule.app[0].aws_cloudfront_distribution.www: Refreshing state... [id=E2GZMTIUVXE6U8]%0Amodule.app[0].aws_ssm_parameter.cloud_distribution_url: Refreshing state... [id=/terraform/staging/cloudfront/url/app.staging.matchya.ai]%0Amodule.route53[0].aws_route53_record.app: Refreshing state... [id=Z0419438LZ88EPNOCFMA_app.staging.matchya.ai_A]%0Amodule.app[0].aws_ssm_parameter.cloudfront_distribution_id: Refreshing state... [id=/terraform/staging/www.app.staging.matchya.ai/cloudfront_distribution_id]%0Amodule.app[0].aws_ssm_parameter.www_cloud_distribution_url: Refreshing state... [id=/terraform/staging/cloudfront/url/www.app.staging.matchya.ai]%0Amodule.route53[0].aws_route53_record.www_app: Refreshing state... [id=Z0419438LZ88EPNOCFMA_www.app.staging.matchya.ai_A]%0Amodule.ec2.aws_eip.bastion[0]: Refreshing state... [id=eipalloc-0adce4ee56c7a5b5c]%0Amodule.ec2.aws_ssm_parameter.bastion_ip[0]: Refreshing state... [id=/terraform/staging/ec2/elastic_ip/bastion_host]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A%0ATerraform will perform the following actions:%0A%0A  # module.rds.aws_db_instance.secure[0] will be updated in-place%0A  ~ resource "aws_db_instance" "secure" {%0A      ~ final_snapshot_identifier             = "staging-final-snapshot-2024-01-27-17-58-16" -> (known after apply)%0A        id                                    = "db-KWJOE7ZAO5CCIOYKPIU72KYFF4"%0A        tags                                  = {}%0A        # (52 unchanged attributes hidden)%0A    }%0A%0A  # module.s3.aws_s3_bucket.company_assets will be created%0A  + resource "aws_s3_bucket" "company_assets" {%0A      + acceleration_status         = (known after apply)%0A      + acl                         = (known after apply)%0A      + arn                         = (known after apply)%0A      + bucket                      = "matchya-staging-company-assets"%0A      + bucket_domain_name          = (known after apply)%0A      + bucket_prefix               = (known after apply)%0A      + bucket_regional_domain_name = (known after apply)%0A      + force_destroy               = false%0A      + hosted_zone_id              = (known after apply)%0A      + id                          = (known after apply)%0A      + object_lock_enabled         = (known after apply)%0A      + policy                      = (known after apply)%0A      + region                      = (known after apply)%0A      + request_payer               = (known after apply)%0A      + tags_all                    = (known after apply)%0A      + website_domain              = (known after apply)%0A      + website_endpoint            = (known after apply)%0A    }%0A%0A  # module.s3.aws_s3_bucket_policy.bucket_policy will be created%0A  + resource "aws_s3_bucket_policy" "bucket_policy" {%0A      + bucket = (known after apply)%0A      + id     = (known after apply)%0A      + policy = (known after apply)%0A    }%0A%0A  # module.s3.aws_s3_bucket_public_access_block.company_assets will be created%0A  + resource "aws_s3_bucket_public_access_block" "company_assets" {%0A      + block_public_acls       = false%0A      + block_public_policy     = false%0A      + bucket                  = (known after apply)%0A      + id                      = (known after apply)%0A      + ignore_public_acls      = false%0A      + restrict_public_buckets = false%0A    }%0A%0APlan: 3 to add, 1 to change, 0 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ASaved the plan to: environment.tfplan%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "environment.tfplan"%0A
::debug::stderr: 
::debug::exitcode: 0

```